app/Http/Controllers/Front/HomeController.php

    public function index()
    {

        //if(Cache::has('home') && Auth::check()==false){return Cache::get('home'); }

        $news_results =  get_all(32, NULL, 3);  // (limit,start,module_id)
        $tesimonialsArr = get_alls(15, NULL, 22);
        $seoArr = getSeoArrayModule(151);
        $blogData =
            BlogPost::where('sts', 'active')->orderBy('dated', 'DESC')->limit(3)->get();
        $get_all_banner =  CmsModuleData::where('sts', 'active')
            ->where('cms_module_id', 2)
            ->orderBy('ID', 'DESC')
            ->limit(3)
            ->get();
        $get_all_features =  CmsModuleData::where('sts', 'active')
            ->where('cms_module_id', 35)
            ->orderBy('item_order', 'ASC')
            ->limit(4)
            ->get();
        $get_all_services =  CmsModuleData::where('sts', 'active')
            ->where('cms_module_id', 33)
            ->orderBy('ID', 'ASC')
            ->limit(10)
            ->get();
        $get_all_testimonials =  CmsModuleData::where('sts', 'active')
            ->where('cms_module_id', 22)
            ->orderBy('ID', 'ASC')
            ->limit(10)
            ->get();
        $get_all_faqs =  CmsModuleData::where('sts', 'active')
            ->where('cms_module_id', 19)
            ->orderBy('ID', 'ASC')
            ->limit(10)
            ->get();
        $get_all_partners =  CmsModuleData::where('sts', 'active')
            ->where('cms_module_id', 34)
            ->orderBy('ID', 'ASC')
            ->limit(10)
            ->get();
        $albums = Album::paginate(20);
        $images = Image::paginate(20);
---
select * from `blog_posts` where `sts` = 'active' order by `dated` desc limit 3
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 2 order by `ID` asc
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 35 order by `item_order` asc limit 4
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 33 order by `ID` asc limit 10
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 22 order by `ID` asc limit 10
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 19 order by `ID` asc limit 10
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 34 order by `ID` asc limit 10
select * from `albums` limit 20 offset 0
select count(*) as aggregate from `albums`
select * from `images` limit 20 offset 0
select count(*) as aggregate from `images`