app/Helpers/design_helper.php

function getDropDown($type = 'top')
{
    $menu_type = \App\Models\Back\MenuType::where('menu_type', strtolower($type))->first();
---
select * from `menu_types` where `menu_type` = 'top' limit 1

function social_media()
{
	$sm = \App\Models\Back\SocialMedia::where('sts', 'active')->orderBy('item_order', 'ASC')->get();
---
select * from `social_media` where `sts` = 'active' order by `item_order` asc