app/Helpers/mysite_helper.php

select * from `cms_module_datas` where `cms_module_datas`.`id` = 151 limit 1
---
function getSeoArrayModule($id)
{
    $moduleData = \App\Models\Back\CmsModuleData::find($id);