app/Helpers/system_helper.php

function get_all($limit, $start, $module_id)
{
    $data = \App\Models\Back\CmsModuleData::where('sts', 'active')
        ->where('cms_module_id', $module_id)
        ->where('sts', 'active')
        ->orderBy('ID', "DESC")
        ->limit($limit, $start)
        ->get();
---
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 3 and `sts` = 'active' order by `ID` desc limit 32

function get_alls($limit, $start, $module_id, $dateFormat = 'M d, Y')
{

    $moduleArr = \App\Models\Back\CmsModule::find($module_id)->toArray();
    $getArr = \App\Models\Back\CmsModuleData::where('sts', 'active')
        ->where('cms_module_id', $module_id)
        ->where('sts', 'active');
    if ($moduleArr['show_ordering_options'] == '1') {
        $getArr->orderBy('item_order', 'ASC');
    } else if ($module_id == '32') {
        $getArr->orderBy('dated', 'DESC');
    } else {
        $getArr->orderBy('ID', "DESC");
    }

    $getArr->limit($limit, $start);
    $getArr = $getArr->get();
---
select * from `cms_modules` where `cms_modules`.`id` = 22 limit 1
select * from `cms_module_datas` where `sts` = 'active' and `cms_module_id` = 22 and `sts` = 'active' order by `item_order` asc limit 15

    function get_widgets($widget = '62')
    {
        $widgetData = \App\Models\Back\Widget::find($widget);
---
select * from `widgets` where `widgets`.`ID` = 81 limit 1

function get_page($id)
{
    $page = \App\Models\Back\CmsModuleData::where('id', $id)->first();
---
select * from `cms_module_datas` where `id` = 104 limit 1

function settingArr()
{
    $settingsArr = \App\Models\Back\Setting::find(1);
---
select * from `settings` where `settings`.`ID` = 1 limit 1

function FindInsettingArr($key)
{
    $settingsArr = \App\Models\Back\Setting::find(1);
---
select * from `settings` where `settings`.`ID` = 1 limit 1

    function get_latest_blog($limit = 2)
    {
        $blogData = \App\Models\Back\BlogPost::with('author', 'comments')->paginate($limit);
---
select * from `blog_comments` where `blog_comments`.`post_id` in (2, 23)
select * from `blog_posts` limit 2 offset 0
select count(*) as aggregate from `blog_posts`

    function get_services($limit = 8)
    {
        $services = \App\Models\Back\CmsModuleData::where('cms_module_id', 33)->paginate($limit);
---
select * from `cms_module_datas` where `cms_module_id` = 33 limit 8 offset 0
select count(*) as aggregate from `cms_module_datas` where `cms_module_id` = 33